# 1.txt.实现 /recv_msg 接口 接收未读消息 多条消息连续收取
# 2.基于 BaiduAI TTS 语音合成 实现消息提醒 实现收取消息时的前缀"以下是来自xxx的消息"
# 3.实现 /ai_uploader 接口 处理Toy的语音指令
# 4.基于 BaiduAI ASR 语音识别 实现Toy语音指令 NLP 自然语言处理
# "我想听洗澡歌" --智能点播内容指令
# "我要给爸爸发消息" --主动发起语音消息指令
# 5.基于 Redis 实现 离线未读消息数量存储
# **任务 1.txt-5 完成人数超过全班 60% 人数 (30人) 可获得集体奖励 5
# **任务 1.txt-5 完成人数超过全班 70% 人数 (35人) 可获得集体奖励 10
# **任务 1.txt-5 完成人数超过全班 80% 人数 (40人) 可获得集体奖励 10
#
# 每日必做任务:
# 整理开发者日志 - 把每天实现的功能完整记录
#
# 特殊任务(完成 1.txt - 5 任务基础上奖励生效):
# 6.优化存储 获取未读消息的函数 实现 App 未读消息 以及 App 未读消息清空
# 7.ai_uploader 对接图灵机器人
# **任务 6 完成 可获得奖励 3
# **任务 7 完成 可获得奖励 2