# 1.txt.实现 WebSocket 服务
# App WebSocket 客户端
# Toy WebSocket 客户端
# 2.基于 WebSocket 实现 App 遥控点播幼教内容
# 3.实现 /friend_list 接口 查询好友列表
# 4.实现 /chat_list 接口 查询聊天记录
# 5.实现 /app_uploader 接口 App上传语音消息
# 6.实现 /toy_uploader 接口 Toy上传语音消息
# 7.App发起语音消息后,Toy收到消息后的语音提醒
# **任务 1.txt-7 完成人数超过全班 60% 人数 (30人) 可获得集体奖励 5
# **任务 1.txt-7 完成人数超过全班 70% 人数 (35人) 可获得集体奖励 5
# **任务 1.txt-7 完成人数超过全班 80% 人数 (40人) 可获得集体奖励 10
# 每日必做任务:
# 整理开发者日志 - 把每天实现的功能完整记录
# 特殊任务(完成 1.txt - 5 任务基础上奖励生效):
# 8.更换语音文件为消息提醒 - 你有来自XXX(好友的备注)的消息
# 9.实现 /recv_msg 收取最后一条消息
# **任务 8 完成 可获得奖励 3
# **任务 9 完成 可获得奖励 2