import re

# 7 匹配邮箱地址，
#  @ 之前必须有内容且只能是字母（大小写） 数字，点（.) 减号 - 且两个点不能挨着
#   最后一个点之后必须有内容且内容只能是字母（ 大小写） 数字且长度大于等于两个字母，小于等于6字节
#   正则规则：       ([a-z]*?[A-Z]*?\d*?\.??-*?)+@.*?\.\w{2,6}
#             ^([a-z]*?[A-Z]*?\d*?[^.{2,}]-*?)+@.*\.\w{2,6}$
#                   ([a-z]*?[A-Z]*?\d*?-*?\.?[^.])+@.*\.\w{2,6}$

#   [-\w.]+@([-\da-zA-Z]+\.)+(a-zZ-A\D]{2-6}

# 8. 从下列字符串中匹配出相应的内容
# <a>whaais</a>
# <b>llllass</b>
# <h1>tttttlaosl</h1>

s1 = """<a>whaais</a>
<b>llllass</b>
<h1>tttttlaosl</h1>"""
res = re.findall('<\w+?>(\w+?)</\w+?>',s1)
print(res)
